p1/m-165deg/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       blockMeshDict;
    object      blockMeshDict;
}

convertToMeters 1;

vertices
(
	(  5  5  5 ) 	//0
	( -5  5  5 ) 	//1
	( -5 -5  5 ) 	//2
	(  5 -5  5 ) 	//3
	(  5  5 -5 ) 	//4
	( -5  5 -5 ) 	//5
	( -5 -5 -5 ) 	//6
	(  5 -5 -5 ) 	//7
);

blocks 			( hex (0 3 2 1 4 7 6 5) (40 40 40) simpleGrading (1 1 1) );

boundary
(
	front
	{
		type 	patch;
		faces 	( ( 2 3 7 6 ) );
	}

	back
	{
		type 	patch;
		faces	( ( 0 1 5 4 ) );
	}
	top
	{
		type 	patch;
		faces 	( ( 0 1 2 3 ) );
	}
	bottom
	{
		type 	wall;
		faces 	( ( 4 5 6 7 ) );
	}
	right
	{
		type 	patch;
		faces 	( ( 0 3 7 4 ) );
	}
	left
	{
		type 	patch;
		faces 	( ( 1 2 6 5 ) );
	}
);